In [1]:
persons_info = [{'id':1,'name':'Anil','sal':300000},
                {'id':5,'name':'Rajesh','sal':400000},
                {'id':4,'name':'Pavan','sal':500000},
                {'id':6,'name':'Ashok','sal':600000},
                {'id':3,'name':'Naveen','sal':200000},
                {'id':2,'name':'Jadeesh','sal':500000},
               ]
# find out who is getting max, min salaries
# findoout average salary

In [31]:
import pandas as pd
df = pd.DataFrame(persons_info)

In [32]:
df

   id     name     sal
0   1     Anil  300000
1   5   Rajesh  400000
2   4    Pavan  500000
3   6    Ashok  600000
4   3   Naveen  200000
5   2  Jadeesh  500000

In [33]:
# get columns
df.columns

Index([u'id', u'name', u'sal'], dtype='object')

In [6]:
# get name column data
df.name

0       Anil
1     Rajesh
2      Pavan
3      Ashok
4     Naveen
5    Jadeesh
Name: name, dtype: object

In [7]:
# get id column data
df.id

0    1
1    5
2    4
3    6
4    3
5    2
Name: id, dtype: int64

In [52]:
# if you want to get name and id
df[['id','name']]

            id     name
2016-01-31   1     Anil
2016-02-29   5   Rajesh
2016-03-31   4    Pavan
2016-04-30   6    Ashok
2016-05-31   3   Naveen
2016-06-30   2  Jadeesh

In [10]:
# get row wise data using .loc, .iloc, .at, .ix
# in pandas row can be recognised using position or an index
df.index

RangeIndex(start=0, stop=6, step=1)

In [14]:
# is it possible to chnage the default index?.. Give a dates as an index to the above data
dates = pd.date_range('20160101',periods=6)
dates

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
# what is the freq argument?
dates = pd.date_range('20160101',periods=6,freq='M')
dates

DatetimeIndex(['2016-01-31', '2016-02-29', '2016-03-31', '2016-04-30',
               '2016-05-31', '2016-06-30'],
              dtype='datetime64[ns]', freq='M')

In [18]:
dates = pd.date_range('20160101',periods=6,freq='H')
dates

DatetimeIndex(['2016-01-01 00:00:00', '2016-01-01 01:00:00',
               '2016-01-01 02:00:00', '2016-01-01 03:00:00',
               '2016-01-01 04:00:00', '2016-01-01 05:00:00'],
              dtype='datetime64[ns]', freq='H')

In [35]:
dates = pd.date_range('20160101',periods=6,freq='M')
dates

DatetimeIndex(['2016-01-31', '2016-02-29', '2016-03-31', '2016-04-30',
               '2016-05-31', '2016-06-30'],
              dtype='datetime64[ns]', freq='M')

In [36]:
df.index = dates
df

            id     name     sal
2016-01-31   1     Anil  300000
2016-02-29   5   Rajesh  400000
2016-03-31   4    Pavan  500000
2016-04-30   6    Ashok  600000
2016-05-31   3   Naveen  200000
2016-06-30   2  Jadeesh  500000

In [28]:
# default iteration gives only columns
for i in df:
    print i

id
name
sal

In [24]:
# to get from index use .loc
df.loc['2016-01-31']

id           1
name      Anil
sal     300000
Name: 2016-01-31 00:00:00, dtype: object

In [53]:

df.loc['2016-01-31':'2016-04-30']

            id    name     sal
2016-01-31   1    Anil  300000
2016-02-29   5  Rajesh  400000
2016-03-31   4   Pavan  500000
2016-04-30   6   Ashok  600000

In [58]:
df.loc['2016-01-31':'2016-04-30','id']

2016-01-31    1
2016-02-29    5
2016-03-31    4
2016-04-30    6
Freq: M, Name: id, dtype: int64

In [59]:
df.loc['2016-01-31':'2016-04-30','id':]

            id    name     sal
2016-01-31   1    Anil  300000
2016-02-29   5  Rajesh  400000
2016-03-31   4   Pavan  500000
2016-04-30   6   Ashok  600000

In [60]:
# column slicing follows the list order in df.columns but not the alphabetical order of columns
df.loc['2016-01-31':'2016-04-30',:'name']

            id    name
2016-01-31   1    Anil
2016-02-29   5  Rajesh
2016-03-31   4   Pavan
2016-04-30   6   Ashok

In [61]:
df.loc['2016-01-31':'2016-04-30','name':'sal']

              name     sal
2016-01-31    Anil  300000
2016-02-29  Rajesh  400000
2016-03-31   Pavan  500000
2016-04-30   Ashok  600000

In [25]:
#to get from position
df.iloc[0]

id           1
name      Anil
sal     300000
Name: 2016-01-31 00:00:00, dtype: object

In [50]:
df.iloc[-1]

id            2
name    Jadeesh
sal      500000
Name: 2016-06-30 00:00:00, dtype: object

In [26]:
# .ix can get the row using position or an index
df.ix[0]

id           1
name      Anil
sal     300000
Name: 2016-01-31 00:00:00, dtype: object

In [39]:
df.ix['2016-01-31']

id           1
name      Anil
sal     300000
Name: 2016-01-31 00:00:00, dtype: object

In [51]:
df.ix[-1]

id            2
name    Jadeesh
sal      500000
Name: 2016-06-30 00:00:00, dtype: object

In [41]:
df

            id     name     sal
2016-01-31   1     Anil  300000
2016-02-29   5   Rajesh  400000
2016-03-31   4    Pavan  500000
2016-04-30   6    Ashok  600000
2016-05-31   3   Naveen  200000
2016-06-30   2  Jadeesh  500000

In [42]:
# head and tail
df.head() # gives first five rows

            id    name     sal
2016-01-31   1    Anil  300000
2016-02-29   5  Rajesh  400000
2016-03-31   4   Pavan  500000
2016-04-30   6   Ashok  600000
2016-05-31   3  Naveen  200000

In [43]:
df.head(10) # first ten rows

            id     name     sal
2016-01-31   1     Anil  300000
2016-02-29   5   Rajesh  400000
2016-03-31   4    Pavan  500000
2016-04-30   6    Ashok  600000
2016-05-31   3   Naveen  200000
2016-06-30   2  Jadeesh  500000

In [44]:
df.tail() # gives a last five rows

            id     name     sal
2016-02-29   5   Rajesh  400000
2016-03-31   4    Pavan  500000
2016-04-30   6    Ashok  600000
2016-05-31   3   Naveen  200000
2016-06-30   2  Jadeesh  500000

In [45]:
df.tail(10) # gives a last ten rows

            id     name     sal
2016-01-31   1     Anil  300000
2016-02-29   5   Rajesh  400000
2016-03-31   4    Pavan  500000
2016-04-30   6    Ashok  600000
2016-05-31   3   Naveen  200000
2016-06-30   2  Jadeesh  500000

In [65]:
# core slicing
df[0:3]

            id    name     sal
2016-01-31   1    Anil  300000
2016-02-29   5  Rajesh  400000
2016-03-31   4   Pavan  500000

In [66]:
df[:3]

            id    name     sal
2016-01-31   1    Anil  300000
2016-02-29   5  Rajesh  400000
2016-03-31   4   Pavan  500000

In [67]:
df[-4:-1]

            id    name     sal
2016-03-31   4   Pavan  500000
2016-04-30   6   Ashok  600000
2016-05-31   3  Naveen  200000

In [68]:
df['name']

2016-01-31       Anil
2016-02-29     Rajesh
2016-03-31      Pavan
2016-04-30      Ashok
2016-05-31     Naveen
2016-06-30    Jadeesh
Freq: M, Name: name, dtype: object